import streamlit as st
import numpy as np
import pandas as pd
import random

st.title("適職診断")
# まずカウンターを初期化 
E = I = S = N = F = T = J = P = 0

answer1 = st.radio(
    "⓵英語の授業中、初対面の人とペアワークが始まった！",
    ["自分から話し始めることが多い", "相手が話し始めるのを待つ"],
    index=None,
)

if answer1 == "自分から話し始めることが多い":
    E += 1
else:
    I += 1

answer2 = st.radio(
    "⓶友達と遊ぶとき",
    ["自分から誘うことが多い", "相手から誘われるのを待つことが多い"],
    index=None,
)

if answer2 == "自分から誘うことが多い":
    E += 1
else:
    I += 1


answer3 = st.radio(
    "⓷休みの日は極力外で遊びたい",
    ["そう思う", "そう思わない"],
    index=None,
)

if answer3 == "そう思う":
    E += 1
else:
    I += 1


answer4 = st.radio(
    "⓸相手にプレゼントを選ぶとき",
    ["実用的なものを選ぶ", "相手が驚きそうなものを選ぶ"],
    index=None,
)

if answer4 == "実用的なものを選ぶ":
    S += 1
else:
    N += 1



answer5 = st.radio(
    "⓹恋人を選ぶとき",
    ["見た目で選ぶ", "雰囲気や空気感で選ぶ"],
    index=None,
)

if answer5 == "見た目で選ぶ":
    S += 1
else:
    N += 1


answer7 = st.radio(
    "⓺相手がトラブルにあって落ち込んでいる",
    ["話を聞いて共感する", "話を聞いてアドバイスをする"],
    index=None,
)

if answer7 == "話を聞いて共感する":
    F += 1
else:
    T += 1


answer8 = st.radio(
    "⓻「君は勉強していないくせにいつも良い結果だね」と言われた",
    ["悲しく思う", "うれしく思う"],
    index=None,
)

if answer8 == "悲しく思う":
    F += 1
else:
    T += 1


answer9 = st.radio(
    "⓼旅行の計画を立てる際",
    ["1日の流れを決める", "ホテルと行きたいところだけ決めておく"],
    index=None,
)

if answer9 == "1日の流れを決める":
    J += 1
else:
    P += 1

if st.button("診断結果"):
    alf1 = "E" if E >= I else "I"
    alf2 = "S" if S >= N else "N"
    alf3 = "F" if F >= T else "T" 
    alf4 = "J" if J >= P else "P"
    MBTI = alf1 + alf2 + alf3 + alf4
    


    #MBTIごとの職業データ 
    jobs = { "ISTJ": ["公務員", "経理", "銀行員", "品質管理", "エンジニア"], 
            "ISFJ": ["看護師", "保育士", "医療事務", "学校職員", "介護福祉士"], 
            "INFJ": ["カウンセラー", "心理士", "作家", "教師", "社会福祉士"], 
            "INTJ": ["研究職", "データサイエンティスト", "エンジニア", "戦略コンサル"], 
            "ISTP": ["整備士", "プログラマー", "消防士", "警察官", "技術者"], 
            "ISFP": ["デザイナー", "美容師", "アーティスト", "保育士", "看護師"], 
            "INFP": ["作家", "イラストレーター", "カウンセラー", "NPO職員"], 
            "INTP": ["研究職", "プログラマー", "大学教授", "データ分析"], 
            "ESTP": ["営業職", "起業家", "スポーツトレーナー", "販売職"], 
            "ESFP": ["タレント", "イベント企画", "接客業", "保育士"], 
            "ENFP": ["マーケティング", "企画職", "デザイナー", "人材系"], 
            "ENTP": ["起業家", "広告クリエイター", "コンサル", "企画職"], 
            "ESTJ": ["管理職", "公務員", "営業マネージャー", "プロジェクト管理"], 
            "ESFJ": ["教師", "看護師", "人事", "営業職", "カウンセラー"], 
            "ENFJ": ["教師", "広報", "人事", "カウンセラー", "コーチ"], 
            "ENTJ": ["経営者", "コンサル", "プロジェクトマネージャー", "弁護士"] }
             
    # 職業一覧を表示 
    if MBTI in jobs: 
        st.badge("適性のある職業一覧")
        for job in jobs[MBTI]: 
            st.write("・", job)


    